/*******************************************************************************
*                Copyright 2001, Marvell International Ltd.
* This code contains confidential information of Marvell semiconductor, inc.
* no rights are granted herein under any patent, mask work right or copyright
* of Marvell or any third party.
* Marvell reserves the right at its sole discretion to request that this code
* be immediately returned to Marvell. This code is provided "as is".
* Marvell makes no warranties, express, implied or otherwise, regarding its
* accuracy, completeness or performance.
********************************************************************************
*/
/**
********************************************************************************
* @file mvHwsPortInitIf.h
*
* @brief
*
* @version   18
********************************************************************************
*/

#ifndef __mvHwServicesPortIf_H
#define __mvHwServicesPortIf_H

#ifdef __cplusplus
extern "C" {
#endif

#include <cpss/common/labServices/port/gop/common/os/hwsEnv.h>
#include <cpss/common/labServices/port/gop/port/mvHwsPortTypes.h>


#ifndef CM3
#define MV_HWS_MAX_LANES_NUM_PER_PORT   10
#else
#if defined RAVEN_DEV_SUPPORT || defined FALCON_DEV_SUPPORT
#define MV_HWS_MAX_LANES_NUM_PER_PORT   8
#else
#define MV_HWS_MAX_LANES_NUM_PER_PORT   4
#endif
#endif

#define MV_HWS_AC5P_GOP_PORT_NUM_CNS    26
#define MV_HWS_AC5P_GOP_PORT_CPU_CNS    105

#define MV_HWS_AC5X_GOP_PORT_CPU_0_CNS  48
#define MV_HWS_AC5X_GOP_PORT_CPU_1_CNS  49

#define MV_HWS_HARRIER_GOP_PORT_NUM_CNS    16
#define MV_HWS_HARRIER_GOP_PORT_CPU_CNS    0xFFFFFFFF /* no such 'cpu port' */

/**
* @enum MV_HWS_PORT_STANDARD
 *
 * @brief Defines the different port standard metrics.
*/
typedef enum
{
/* 0  */ _100Base_FX,
/* 1  */ SGMII,
/* 2  */ _1000Base_X,
/* 3  */ SGMII2_5,
/* 4  */ QSGMII,
/* 5  */ _10GBase_KX4,
/* 6  */ _10GBase_KX2,   /* 10GBase-DHX */
/* 7  */ _10GBase_KR,
/* 8  */ _20GBase_KR2,
/* 9  */ _40GBase_KR,
/* 10 */ _100GBase_KR10,
/* 11 */ HGL,
/* 12 */ RHGL,
/* 13 */ CHGL,   /* CHGL_LR10 */
/* 14 */ RXAUI,
/* 15 */ _20GBase_KX4,   /* HS-XAUI */
/* 16 */ _10GBase_SR_LR,
/* 17 */ _20GBase_SR_LR2,
/* 18 */ _40GBase_SR_LR,
/* 19 */ _12_1GBase_KR,          /* Serdes speed: 12.5G;    Data speed: 12.1G */
/* 20 */ XLHGL_KR4,              /* 48G */
/* 21 */ HGL16G,
/* 22 */ HGS,
/* 23 */ HGS4,
/* 24 */ _100GBase_SR10,
/* 25 */ CHGL_LR12,
/* 26 */ TCAM,
/* 27 */ INTLKN_12Lanes_6_25G,
/* 28 */ INTLKN_16Lanes_6_25G,
/* 29 */ INTLKN_24Lanes_6_25G,
/* 30 */ INTLKN_12Lanes_10_3125G,
/* 31 */ INTLKN_16Lanes_10_3125G,
/* 32 */ INTLKN_12Lanes_12_5G,
/* 33 */ INTLKN_16Lanes_12_5G,
/* 34 */ INTLKN_16Lanes_3_125G,
/* 35 */ INTLKN_24Lanes_3_125G,
/* 36 */ CHGL11_LR12,

/* 37 */ INTLKN_4Lanes_3_125G,
/* 38 */ INTLKN_8Lanes_3_125G,
/* 39 */ INTLKN_4Lanes_6_25G,
/* 40 */ INTLKN_8Lanes_6_25G,

/* 41 */ _2_5GBase_QX,
/* 42 */ _5GBase_DQX,
/* 43 */ _5GBase_HX,
/* 44 */ _12GBaseR,              /* Serdes speed: 12.1875G;    Data speed: 1*11.8G */
/* 45 */ _5_625GBaseR,           /* Serdes speed:   5.625G;    Data speed: 1*5.45G*/
/* 46 */ _48GBaseR4,             /* Serdes speed: 12.1875G;    Data speed: 4*11.8G */
/* 47 */ _12GBase_SR,            /* Serdes speed: 12.1875G;    Data speed: 1*11.8G */
/* 48 */ _48GBase_SR4,           /* Serdes speed: 12.1875G;    Data speed: 4*11.8G */
/* 49 */ _5GBaseR,               /* Serdes speed: 5.15625G;    Data speed: 1*5G */
/* 50 */ _22GBase_SR,            /* Serdes speed: 11.5625G;    Data speed: 2*11.2G */
/* 51 */ _24GBase_KR2,           /* Serdes speed: 12.1875G;    Data speed: 2*11.8G */
/* 52 */ _12_5GBase_KR,          /* Serdes speed: 12.8906G;    Data speed: 1*12.5G */
/* 53 */ _25GBase_KR2,           /* Serdes speed: 12.8906G;    Data speed: 2*12.5G */
/* 54 */ _50GBase_KR4,           /* Serdes speed: 12.8906G;    Data speed: 4*12.5G */

/* 55 */ _25GBase_KR,            /* Serdes speed: 25.78125G;   Data speed: 1*25G */
/* 56 */ _50GBase_KR2,           /* Serdes speed: 25.78125G;   Data speed: 2*25G */
/* 57 */ _100GBase_KR4,          /* Serdes speed: 25.78125G;   Data speed: 4*25G */
/* 58 */ _25GBase_SR,            /* Serdes speed: 25.78125G;   Data speed: 1*25G */
/* 59 */ _50GBase_SR2,           /* Serdes speed: 25.78125G;   Data speed: 2*25G */
/* 60 */ _100GBase_SR4,          /* Serdes speed: 25.78125G;   Data speed: 4*25G */
/* 61 */ _100GBase_MLG,          /* Serdes speed: 25.78125G;   Data speed: 4*25G */
/* 62 */ _107GBase_KR4,          /* Serdes speed: 27.5G;       Data speed: 4*26.66G (106.6G)*/
/* 63 */ _25GBase_KR_C,          /* Consortium - Serdes speed: 25.78125G;   Data speed: 1*25G */
/* 64 */ _50GBase_KR2_C,         /* Consortium - Serdes speed: 25.78125G;   Data speed: 2*25G */
/* 65 */ _40GBase_KR2,           /* Serdes speed: 20.625G;     Data speed: 2*20G */
/* 66 */ _29_09GBase_SR4,        /* Serdes speed: 7.5G;        Data speed: 4*7.272G */

/* 67 */ _40GBase_CR4,
/* 68 */ _25GBase_CR,
/* 69 */ _50GBase_CR2,
/* 70 */ _100GBase_CR4,
/* 71 */ _25GBase_KR_S,
/* 72 */ _25GBase_CR_S,
/* 73 */ _25GBase_CR_C,
/* 74 */ _50GBase_CR2_C,

/* 75 */ _50GBase_KR,              /* Serdes speed: _26_5625G;   Data speed: 1*51.51G */
/* 76 */ _100GBase_KR2,            /* Serdes speed: _26_5625G;   Data speed: 2*51.51G */
/* 77 */ _200GBase_KR4,            /* Serdes speed: _26_5625G;   Data speed: 4*51.51G */
/* 78 */ _200GBase_KR8,            /* Serdes speed:  25.78125G;  Data speed: 8*25G */
/* 79 */ _400GBase_KR8,            /* Serdes speed: _26_5625G;   Data speed: 8*51.51G */

/* 80 */ _102GBase_KR4,            /* Serdes speed: _26.25G;     Data speed: 4*25G (102G)*/
/* 81 */ _52_5GBase_KR2,           /* Serdes speed: _27.1G;      Data speed: 2*26.28G (52.5G) */
/* 82 */ _40GBase_KR4,
/* 83 */ _26_7GBase_KR,            /* Serdes speed: 27.5G;       Data speed: 1*26.66G (26.66G) */
/* 84 */ _40GBase_SR_LR4,
/* 85 */ _50GBase_CR,
/* 86 */ _100GBase_CR2,
/* 87 */ _200GBase_CR4,
/* 88 */ _200GBase_CR8,
/* 89 */ _400GBase_CR8,
/* 90 */ _200GBase_SR_LR4,
/* 91 */ _200GBase_SR_LR8,
/* 92 */ _400GBase_SR_LR8,
/* 93 */ _50GBase_SR_LR,
/* 94 */ _100GBase_SR_LR2,
/* 95 */ _20GBase_KR,
/* 96 */ _106GBase_KR4,

    /* 1 MAC USX modes*/
/* 97 */ _2_5G_SXGMII,          /*Serdes speed: 2.578125G;Data Speed: 1 MAC  (10M..2.5G) */
/* 98 */ _5G_SXGMII,            /*Serdes speed: 5.15625G; Data Speed: 1 MAC  (10M..5G) */
/* 99 */ _10G_SXGMII,           /*Serdes speed: 10.3125G; Data Speed: 1 MAC  (10M..10G) */

    /* 2 MACs USX modes*/
/* 100*/ _5G_DXGMII,            /*Serdes speed: 5.15625G; Data Speed: 2 MACs (10M..2.5G) */
/* 101*/ _10G_DXGMII,           /*Serdes speed: 10.3125G; Data Speed: 2 MACs (10M..5G) */
/* 102*/ _20G_DXGMII,           /*Serdes speed: 20.625G;  Data Speed: 2 MACs (10M..10G) */

    /* 4 MACs USX modes*/
/* 103*/ _5G_QUSGMII,           /*Serdes speed: 5G;       Data Speed: 4 MACs (10M..1G) */
/* 104*/ _10G_QXGMII,           /*Serdes speed: 10.3125G; Data Speed: 4 MACs (10M..2.5G) */
/* 105*/ _20G_QXGMII,           /*Serdes speed: 20.625G;  Data Speed: 4 MACs (10M..5G) */

    /* 8 MACs USX modes*/
/* 106*/ _10G_OUSGMII,          /*Serdes speed: 10G;      Data Speed: 8 MACs (10M..1G) */
/* 107*/ _20G_OXGMII,           /*Serdes speed: 20.625G;  Data Speed: 8 MACs (10M..2.5G) */

/* 108*/ _42GBase_KR4,          /*serdes speed: 10.9375G  Data Speed: 4 MAC  */
/* 109*/ _53GBase_KR2,          /*serdes speed: 27.34375G*/
/* 110*/ _424GBase_KR8,         /*serdes speed: _28_125G_PAM4;   Data speed: 8*54.54G */
/* 111*/ _2500Base_X,           /**/
/* 112*/ _212GBase_KR4,         /*Serdes speed: _28_125G_PAM4;   Data speed: 4*54.54G */
/* 113*/ _106GBase_KR2,         /*Serdes speed: _28_125G_PAM4;   Data speed: 2*54.54G */
/* 114*/ _102GBase_KR2,         /*Serdes speed: _27_1875_PAM4;   Data speed: 2*52.72G */

    NON_SUP_MODE,
    LAST_PORT_MODE = NON_SUP_MODE

}MV_HWS_PORT_STANDARD;

/* Macro for two lanes speeds/port modes - to ease the use. */
#define HWS_TWO_LANES_MODE_CHECK(_mode) ((_mode == _50GBase_KR2) || (_mode == _50GBase_KR2_C) || (_mode == _40GBase_KR2) || \
                                         (_mode == _50GBase_CR2) || (_mode == _50GBase_CR2_C) || (_mode == _50GBase_SR2) || \
                                         (_mode == _52_5GBase_KR2) || (_mode == _53GBase_KR2))

#define HWS_10G_MODE_CHECK(_mode) ((_mode == _10GBase_KR) || (_mode == _10GBase_SR_LR))
/* since MAC/PCS of 20GBase_KR operates in configuration of 25G - include 20G R1 in this macro */
#define HWS_25G_MODE_CHECK(_mode) ((_mode == _25GBase_KR_S) || (_mode == _25GBase_KR) || (_mode == _25GBase_KR_C) || \
